In [1]:
import pandas as pd
import numpy as np

In [2]:
hcmst = pd.read_csv("hcmst2017.csv", encoding="mac_roman")

/usr/local/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3020: DtypeWarning: Columns (47,102) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
cols = ["Q5", "Q21A_Year", "Q21A_Month", "Q21B_Year", "Q21B_Month", "Q21C_Year", "Q21C_Month", "Q21D_Year", "Q21D_Month"]
colnames = ["same_sex", "year_met", "month_met", "year_dating", "month_dating", "year_movein", "month_movein", "year_marry", "month_marry"]
relevant = hcmst[cols]
relevant.columns = colnames
relevant = relevant.loc[relevant["year_met"].notna()]
relevant.head()

,same_sex,year_met,month_met,year_dating,month_dating,year_movein,month_movein,year_marry,month_marry
1,NaN,1983,May,1995,August,1996,February,1996,February
2,NaN,2006,January,2006,June,2006,July,2008,May
4,NaN,1983,September,1983,October,1984,August,1984,August
5,"No, we are an opposite-sex couple",1981,December,1982,June,1982,June,1982,June
6,NaN,1966,October,1967,January,1969,August,1969,August

In [4]:
def month_year(row):
    year = row[0]
    if pd.isna(year) or year == "Refused":
        return np.nan
    month = "" if row[1] == "Refused" or pd.isna(row[1]) else row[1] + " "
    return month + year

In [5]:
clean = pd.DataFrame()
clean["same_sex"] = relevant["same_sex"].apply(
    lambda x: 0 if str(x).startswith("No") else -1 if pd.isna(x) else 1)
for stage in ["met", "dating", "movein", "marry"]:
    clean[stage] = relevant[["year_"+stage, "month_"+stage]].apply(month_year, axis=1)
clean.head()

   same_sex             met        dating         movein          marry
1        -1        May 1983   August 1995  February 1996  February 1996
2        -1    January 2006     June 2006      July 2006       May 2008
4        -1  September 1983  October 1983    August 1984    August 1984
5         0   December 1981     June 1982      June 1982      June 1982
6        -1    October 1966  January 1967    August 1969    August 1969

In [8]:
clean = clean.loc[clean["same_sex"] != -1].sample(80)
clean

      same_sex             met          dating          movein           marry
2919         0    January 2001       June 2002      April 2011            2015
1591         0       June 1998       June 1998             NaN             NaN
3476         1   February 2011   February 2011  September 2011       July 2014
2895         0      April 2004        May 2004  September 2004             NaN
548          0       July 2015  September 2015    October 2015             NaN
258          0  September 1978  September 1980  September 1982    January 1984
539          0     August 1974    January 1975  September 1977       July 1979
1126         0      March 1969   November 1970   December 1971   December 1971
1792         0    January 2016      April 2017             NaN             NaN
15           0    October 2002    October 2004        May 2006       June 2011
1813         0       June 2002       July 2002     August 2002     August 2006
1131         1   November 2011    January 2012    October 2015             NaN
212          1       June 1993       June 1993    October 2015             NaN
902          0   December 2000   December 2000    January 2002       July 2002
3455         1     August 2015     August 2015             NaN             NaN
2940         0  September 2003  September 2003   February 2005  September 2005
2036         0   December 2010        May 2011   November 2012        May 2017
3506         1    January 2016    January 2017             NaN             NaN
1080         1   November 2012   November 2012  September 2015             NaN
1933         1      March 2006      March 2006      March 2006             NaN
678          0   December 2014            2015     August 2015             NaN
921          0  September 2006   November 2007     August 2010     August 2010
1476         1     August 2013  September 2013             NaN             NaN
720          0        May 1985       July 1985   February 1986   November 1986
1367         1    October 1981    October 1981        May 1982    October 2013
17           1  September 2002  September 2002  September 2004       June 2007
3178         0        May 2008             NaN   February 2008        May 2008
3329         1  September 2009    October 2009             NaN             NaN
2663         0     August 2004    October 2007             NaN             NaN
1687         0      April 1981       June 1981       June 1984      March 1990
...        ...             ...             ...             ...             ...
3488         0     August 1987   December 1988     August 1989       June 1990
673          1   November 2002  September 2006      March 2007    October 2015
3495         1   December 2016    January 2017             NaN             NaN
2642         1   February 1986     August 1986      April 1989       July 2015
3496         0  September 1998   February 1999      April 1999     August 1999
2212         1      April 1992      March 1993      March 1993             NaN
3489         0      March 1998      March 1998      March 1998       July 1998
2306         0    October 2016    October 2016             NaN             NaN
500          1      April 2009      April 2011             NaN             NaN
2377         1   December 2005   December 2005   December 2005             NaN
1767         0       June 2006    October 2011   December 2012   November 2013
2586         1      March 2016      March 2016             NaN             NaN
389          1   November 1997   December 1997  September 1998             NaN
3467         1     August 1976    January 2013      March 2017             NaN
2495         0      March 1984      March 1984      March 1984    January 1985
398          0    October 2016   December 2016             NaN             NaN
1762         0  September 2000  September 2000   February 2001       June 2006
721          1       June 2004       June 2004       July 2004        May 2014
3475         0        May 1967       June 1970   February 1974   February 1971
1259         0   November 2001   December 2001    October 2003    October 2006
466          1   November 2005   November 2005      April 2006     August 2010
833          0       June 1999       June 1999      April 2002      April 2002
2620         1  September 2013      March 2015      March 2015             NaN
3500         0      April 1978       June 1978       June 1978   November 1980
3460         1  September 1974  September 1990    January 2012             NaN
395          0       July 1981   February 1982        May 1982   December 1982
2506         0   November 1994   November 1994    January 1995   December 1994
328          1    January 1990      March 1990             NaN             NaN
1275         1   February 1993             NaN             NaN             NaN
2508         0      March 2005      April 2005     August 2005  September 2011

[80 rows x 5 columns]

In [9]:
clean.to_csv("../data/time-data.csv", na_rep="null", index=False)